Merge remote-tracking branch 'upstream/main' into feature/catalog_import_export
